Revit 2026 API

# View3DToggleToPerspective Method

---

Toggles this view to perspective.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ToggleToPerspective()
```
```vb
Public Sub ToggleToPerspective
```
```cpp
public:
void ToggleToPerspective()
```
```fsharp
member ToggleToPerspective : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This view cannot be toggled. |

This view can only be toggled to perspective if no view specific elements are contained.

#### Reference

View3D Class

Autodesk.Revit.DB Namespace